<template>
<div>
<h1>v-for</h1>
<p>Директива <span class="keyWords"> v-for</span> використовується для відтворення списку елементів на 
основі масиву даних.
 У директиви v-for особливий синтаксис запису:<span class="keyWords"> item in items</span>,
де <span class="keyWords">items</span> - вихідний масив, а <span class="keyWords">item</span> - 
посилання на поточний елемент масиву.</p>
<p>
Усередині блоку <span class="keyWords">v-for</span> нам доступні властивості з області видимості батьківського елементу. 
У <span class="keyWords">v-for</span> також є другий опціональний параметр з індексом поточного елемента.
</p>
<h1>Збереження стану</h1>
<p>При оновленні Vue списку елементів, що відображається директивою <span class="keyWords">v-for</span>, 
за замовчуванням використовується стратегія оновлення «на місці». 
Якщо порядок елементів масиву або об'єкта змінився, Vue не стане переміщати елементи <span class="keyWords">DOM</span>,
а просто оновить кожен елемент «на місці», щоб він відображав нові дані по відповідному індексу.
Режим за замовчуванням ефективний, але застосовується лише у випадках, коли результат відтворення 
вашого списку не покладається на стан дочірніх компонентів або тимчасовий стан DOM.</p>
<p>Щоб підказати Vue, як відстежувати ідентичність кожного елемента, що дозволить перевикористати і переміщати існуючі елементи, треба  використати унікальний атрибут <span class="keyWords">key</span> для кожного елемента.</p>
</div>
</template>
<script>
export default{
    data(){
        return{}
    }
}
</script>
<style scoped>
.keyWords{
    color:#BF33FF;
}
h1{
    text-align:center;
}
div{
    border:5px solid black;
}
</style>